app/controllers/articles_controller.rb

  def edit
    @article = Article.find(params[:id]) #this is to populate the existing record's data to the edit form
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]